content/blog/click-drag-vanilla-js.md
+++
title = "Implementing Click & Drag with Vanilla JS"
author = ["Alex Carney"]
date = 2019-07-03T19:45:00+01:00
tags = ["svg", "web", "js"]
draft = false
+++

<figure>
  <div id="main"></div>
  <figcaption>
    <p>Try clicking and dragging on this circle.</p>
  </figcaption>
</figure>
<script type="text/javascript" src="/js/click-drag.js"></script>

> **Disclaimer:**
>
> This post makes use of a number of interactive elements to help illustrate a few
> concepts. Unfortunately these do not yet work on mobile devices - sorry mobile
> users!

I have for quite some time now wanted to play around with web development some
more, particularly using web technologies to build user interfaces of some
kind. However there is just **so much** out there it's been impossible for me to
really get anywhere past a "Hello, World!" tutorial before I find myself trying
out the next new shiny.

So I've decided to abandon everything and try a bottom up approach where I see
how far I can push the core web technologies - HTML, CSS and
JavaScript. Hopefully then by the time I start using one of the gazillion
libraries out there I will have a better understanding of why I
needed it in the first place.

In this post I will be looking at implementing clicking and dragging
functionality using only vanilla JavaScript. Clicking and dragging as a concept
can apply to many kinds of interactions so in this instance I'm specifically
referring to clicking on an SVG element moving it around on the page as
illustrated by the demo above.

<!--more-->


## Setup {#setup}

All we need to get started is a HTML document that contains some markup which
provides someplace we can reference and attach our image element to, as well as
loading the code we write.

{{< highlight html >}}
<div id="main"></div>
<script type="text/javascript" src="./click-drag.js"></script>
{{< /highlight >}}

Then the first step is to create our SVG image element to act as our "canvas"
that we can draw on.

<a id="code-snippet--create-canvas"></a>
{{< highlight javascript >}}
const svgns = "http://www.w3.org/2000/svg"
const main = document.getElementById("main")

const canvas = document.createElementNS(svgns, "svg")
canvas.setAttribute("width", "100%")
canvas.setAttribute("height", "100%")
canvas.style.border = "solid 2px #242930"

main.appendChild(canvas)
{{< /highlight >}}

A few things to note:

-   By adding our `<svg>` element as a child of some `<div>` element and setting
    both the `width` and `height` to `100%` our canvas will be able to
    scale responsively based on the styles applied to the parent `<div>`
-   You might already be familiar with the [`document.createElement()`](https://developer.mozilla.org/en-US/docs/Web/API/Document/createElement) function for
    creating HTML elements using JavaScript. However in order to work with SVG
    elements we need to use the [`document.createElementNS()`](https://developer.mozilla.org/en-US/docs/Web/API/Document/createElementNS) function which allows
    us to use the SVG namespace instead of the HTML default.


## The View Box {#the-view-box}

The next step is to construct an appropriate `viewBox` definition for our
canvas. For more information on the `viewBox` you can refer to the [documentation](https://developer.mozilla.org/en-US/docs/Web/SVG/Attribute/viewBox)
but to briefly summarise. An SVG image exists on an infinite plane and the
`viewBox` is the window we use to view a portion of that space, changing the
definition of the `viewBox` allows you to zoom in and out on particular regions.

For our purposes what's important is that we construct a `viewBox` that matches
the proportions of the `<svg>` element as it is displayed in the browser. If
these proportions do not match then the element being dragged around will not
accurately track the cursor, either racing away from or lagging behind it.

One minor issue is that in our setup we didn't explicitly set the dimensions of
our `<svg>` element - so how can we know its proportions? Thankfully once the
`<svg>` as been added to the page we can ask the browser for the bounding box
around the element.

<a id="code-snippet--set-viewbox"></a>
{{< highlight javascript >}}
let bbox = canvas.getBoundingClientRect()
{{< /highlight >}}

Among other properties that are outlined on [this](https://developer.mozilla.org/en-US/docs/Web/API/Element/getBoundingClientRect) page we can get the width and
height of the rendered image in pixels from which its easy to calculate the
aspect ratio.

<a id="code-snippet--set-viewbox"></a>
{{< highlight javascript >}}
const aspectRatio = bbox.width / bbox.height
{{< /highlight >}}

We're free to choose whichever scale we want for the vertical height of the
`viewBox` into the `<svg>` element. I have chosen `100` simply because it feels
like a nice round number. Once we've decided on a scale for the height, it's
easy enough to calculate the corresponding width from our aspect ratio.

<a id="code-snippet--set-viewbox"></a>
{{< highlight javascript >}}
const height = 100
const width = height * aspectRatio
{{< /highlight >}}

With the dimensions of the `viewBox` taken care of all that is left to do is
decide on the coordinates to assign to the top left corner of the `<svg>`
element and assign the view box to our canvas.

<a id="code-snippet--set-viewbox"></a>
{{< highlight javascript >}}
const viewBox = {minX: 0, minY: 0, width: width, height: height}

const viewBoxStr = [
  viewBox.minX, viewBox.minY, viewBox.width, viewBox.height
].join(" ")

canvas.setAttribute("viewBox", viewBoxStr)
{{< /highlight >}}


## Something to Click on {#something-to-click-on}

By this point we have finished preparing our canvas and it's time to add
something for us to interact with. To keep things simple I will stick to a `<circle>`
element, though the method we use here should apply to any SVG element (or any
collection of elements under a `<g>` tag).

<a id="code-snippet--add-circle"></a>
{{< highlight javascript >}}
const circle = document.createElementNS(svgns, "circle")
circle.setAttribute("cx", viewBox.width / 2)
circle.setAttribute("cy", viewBox.height / 2)
circle.setAttribute("r", 15)
circle.setAttribute("fill", "#57cc8a")

canvas.appendChild(circle)
{{< /highlight >}}

> **Note:**
>
> Of course the way in which you define the position of your interactive element
> will depend on the element you have chosen.


## Implementing the Drag {#implementing-the-drag}

We will create an event handler for the `mousemove` event and attach it to
our canvas.

{{< highlight javascript >}}
canvas.addEventListener("mousemove", (event) => {
  // Do something clever here...
})
{{< /highlight >}}

The function we write will be called every time the cursor moves regardless of
whether the user has clicked or not. This means our event handler has to be able
to cope with two situations, the cursor moving when the user has clicked and the
cursor moving when the user has not clicked.

To do this we will declare a variable called `clicked` outside the scope of our
function.

<a id="code-snippet--dragging"></a>
{{< highlight javascript >}}
let clicked = false
{{< /highlight >}}

For the moment we will ignore the details around how this variable is updated
(it is covered in the next section), instead let's focus on being what we do
once while the cursor is moving about the page

Let's get the simpler case out of the way first


### Not Clicked {#not-clicked}

When the mouse is moving but the user has not clicked, then there is nothing for
us to do! We can simply check the value of the `clicked` variable and stop the
function if it meets the criteria.

{{< highlight javascript >}}
if (!clicked) {
  return
}
{{< /highlight >}}
