content-org/blog.org
*** Clicked

Now for the interesting part! The mouse is moving and the user has clicked on
the circle, all we have to do now is update its position to match
the cursor's current position. The only problem is... where is it?

Like all mouse related events the ~event~ object passed into the event handler
will contain a number of position related properties.

- ~e.client<XY>~: Coordinates of the cursor with respect to the current portion
  of the document visible on the page.
- ~e.offset<XY>~: Coordinates of the cursor with respect to the edge of the
  target element
- ~e.page<XY>~: Coordinates of the cursor with respect to the entire HTML page,
  including any portions of the page not currently visible
- ~e.screen<XY>~: Coordinates of the cursor with respect to the user's display

Reading through those descriptions you would imagine that the ~e.offset<XY>~
properties would be the best fit for our use case. However it's not quite as
simple as that.

Below you should see 2 boxes, the bigger one on the left is our canvas. The
smaller box on the right contains a smaller circle that represents the
calculated position of the cursor based on the ~offset<XY>~ properties like so.

#+BEGIN_SRC javascript
const x = event.offsetX
const y = event.offsetY
#+END_SRC

Try moving the mouse across the canvas and keep an eye on the calculated
position.

#+BEGIN_EXPORT html
<figure>
  <div id="offset-demo"
       style="display:grid;grid-template-columns:50% auto;grid-gap:10px">
  <h3 id="offset-title" style="margin: 0; padding: 15px; padding-top: 0">
    Cursor Position: Offset
  </h3>
    <div>
      <p style="margin:0;padding-left:20px">Target: <span id="offset-target"></span></p>
      <p style="margin:0;padding-left:20px">Position: <span id="offset-position"></span></p>
    </div>
    <svg width="100%"
         id="offset-demo-canvas"
         style="border: solid 2px #242930">
    </svg>
    <svg width="50%"
         id="offset-posbox"
         style="border: solid 2px #242930;margin:auto"><svg>
  </div>
  <figcaption>
    <p>
      Determining the cursor's position using the <code>event.offsetX</code> and
      <code>event.offsetY</code> properties
    </p>
  </figcaption>
</figure>
<script type="text/javascript" src="./js/click-drag-offset.js"></script>
#+END_EXPORT

Notice the issue when we move across the circle? Why does the calculated
position of the cursor suddenly jump whenever we touch it? The answer lies in
the description of the ~offset<XY>~ property "with respect to the edge of the
*target* element"

When initially trying to implement this I incorrectly assumed that the target
element meant the element that we attached the event listener to - the canvas. In
fact the target element is whichever element is currently under the cursor

To work around this we can calculate the offset values we need ourselves. In
order to do this we will make use of both the bounding box returned from the
~canvas.getBoundingClientRect()~ method as well as the ~client<XY>~ properties
found on the mouse event.

It turns out that the bounding box also returns the coordinates of the top left
corner of the canvas relative to the user's current view of the document -
exactly the same coordinate system used by the ~client<XY>~ properties! From
those two pieces of information it's easy enough to recover the ~offset<XY>~
values ourselves.

#+BEGIN_SRC javascript
bbox = canvas.getBoundingClientRect()

const x = event.clientX - bbox.left
const y = event.clientY - bbox.top
#+END_SRC

By calculating the coordinates using values that are independent of the element
currently underneath the cursor we sidestep any issues that arise from a
changing target. Try the same thing again on the canvas below.

#+BEGIN_EXPORT html
<figure>
  <div id="client-demo"
       style="display:grid;grid-template-columns:50% auto;grid-gap:10px">
    <h3 id="offset-title" style="margin: 0; padding: 15px; padding-top: 0">
      Cursor Position: Client
    </h3>
    <div>
      <p style="margin:0;padding-left:20px">Target: <span id="client-target"></span></p>
      <p style="margin:0;padding-left:20px">Position: <span id="client-position"></span></p>
    </div>
    <svg width="100%"
         id="client-demo-canvas"
         style="border: solid 2px #242930">
    </svg>
      <svg width="50%"
           id="client-posbox"
           style="border: solid 2px #242930;margin:auto"><svg>
  </div>
  <figcaption>
    <p>
      Determining the cursor's position using the <code>event.clientX</code> and
      <code>event.clientY</code> properties
    </p>
  </figcaption>
</figure>
<script type="text/javascript" src="./js/click-drag-client.js"></script>
#+END_EXPORT

#+BEGIN_QUOTE
*Important:*

Since the values ~bbox.top~ and ~bbox.left~ are defined relative to the user's
current view on the document these values are *not* constant. They will change
whenever the user alters their view of the page, i.e. performing actions like
resizing the window or scrolling. This is why we ask for an updated bounding box
every time our event handler is called.
#+END_QUOTE

Now that we can reliably know the position of the cursor, we can focus on the
final piece of this puzzle - updating the position of our ~<circle>~
element. There is however one further issue to work through. The position of the
cursor that we've just calculated is using a different coordinate system to the
one used to draw our circle!

Although we have managed to correctly calculate the cursor's position relative
to our canvas, that position is measured using pixels which makes it highly
dependent on the resolution of the user's screen. A user who uses a 4K monitor
and positions their cursor at the bottom right of the canvas will have a
calculated position much larger than a user on a smartphone...

What this means is that if we map this calculated position directly onto the
circle it won't accurately follow the cursor. The only time the circle would
follow the cursor correctly is when the pixel based coordinates line up with the
coordinate system used in the SVG image. I.e. when the dimensions of the canvas
match up *exactly* with the scale used to define our ~viewBox~ which in this
case would be ~100px~ tall

Since the mouse circle and the circle use different coordinate systems, we don't
actually care about the exact position we have just calculated. What's more
important is the position of the cursor relative to bounds of the canvas - a
percentage. For example, let's say that the cursor was halfway down the canvas
(~50%~) then we could calculate the corresponding coordinate value in the SVG
coordinate system by multiplying the total height by ~50%~. In our particular
case this would mean setting ~y = 100 * 0.5 = 50~.

We can adopt this approach by using the ~width~ and ~height~ information
returned as part of the bounding box to modify our calculation to produce a
percentage rather than an absolute value.

#+BEGIN_SRC javascript
const x = (event.clientX - bbox.left) / bbox.width
const y = (event.clientY - bbox.top) / bbox.height
#+END_SRC

To then convert this percentage into its corresponding value in the SVG
coordinate system all we have to do is multiply it by the width and height of
that system and assign the result to our circle's position!

#+BEGIN_SRC javascript
circle.setAttriubte("cx", x * viewBox.width)
circle.setAttribute("cy", y * viewBox.height)
#+END_SRC

Bringing all that together we end up with the following implementation of our
~mousemove~ event handler.

#+NAME: dragging
#+BEGIN_SRC javascript
canvas.addEventListener("mousemove", (event) => {

  if (!clicked) {
    return
  }

  bbox = canvas.getBoundingClientRect()

  const x = (event.clientX - bbox.left) / bbox.width
  const y = (event.clientY - bbox.top) / bbox.height

  circle.setAttribute("cx", x * viewBox.width)
  circle.setAttribute("cy", y * viewBox.height)
})
#+END_SRC

Nearly there! The only thing left to do is decide on how we want to update the
~clicked~ variable.

