content/blog/click-drag-vanilla-js.md


## Click Detection {#click-detection}

Finally all that's left is to do is decide how we want to toggle the dragging
behaviour. This mostly comes down to how you want the user to interact with the
draggable object and will change depending on your use case. To keep things
simple I will go with a fairly simple interaction model

-   If the mouse is over the circle and the user clicks then start dragging
-   If the user releases the mouse button then stop dragging

<a id="code-snippet--clicking"></a>
{{< highlight javascript >}}
circle.addEventListener("mousedown",  (_) => { clicked = true })
circle.addEventListener("mouseup", (_) => { clicked = false })
{{< /highlight >}}

Additionally I will impose one final condition

-   If the mouse leaves the bounds of the canvas then stop dragging.

<a id="code-snippet--clicking"></a>
{{< highlight javascript >}}
canvas.addEventListener("mouseleave", (_) => { clicked = false })
{{< /highlight >}}

This last point is to work around an issue that arises when the user moves the
cursor out of the bounds of the canvas and releases the mouse button. Since the
cursor is no longer over the circle the handler for the `mouseup` event on the
circle is never fired so when the user brings their cursor back over the canvas
our code still believes the user never released the mouse button and so the
circle will appear "stuck" to their cursor until they click again.
