content-org/blog.org
** Conclusion

There you have it, those were some of the basics required to get a working proof
of concept of clicking and dragging functionality using only the JavaScript APIs
that come with your web browser. However in writing this blog post I realised
as with anything that the rabbit hole goes deep and there are many
considerations to keep in mind if you wanted to "productionise" this code for
any real usage.

- *Touchscreen Support*

  If you were reading this post on a mobile device you will already have noticed
  that none of the interactive demos have worked. This is because touchscreens
  have their own family of ~touchXXXX~ events that are triggered when a user
  interacts with a webpage. While there is some mouse emulation done by the
  browsers (e.g. a ~touchstart~ event will trigger a ~mousedown~ event if not
  handled), some key events such as ~mousemove~ are not emulated and require
  dedicated support in your code. See [[https://www.html5rocks.com/en/mobile/touch/][these]] [[https://www.html5rocks.com/en/mobile/touchandmouse/][articles]] for more details

- *Snap to Center*

  This is only a minor issue and depending on your use case may not be a problem
  at all. Currently whenever you pick up the circle its center snaps to the
  cursor's position. There may be situations where you would prefer the keep the
  object's relative position to the cursor e.g. fine adjustments, the last thing
  you would want is for the object to jump to the cursor just because the user
  happened to click on it off center.

  A way around this would be to record the original positions of both the mouse
  cursor and the object on a click, then on each ~mousemove~ event calculate the
  distance moved by the cursor and apply it to the original recorded position of
  the object.

- *Multiple Objects*

  Chances are when using this functionality in a real application you would want
  the ability to click and drag on multiple objects. Adding support for this
  would require reworking at least some of the code, having the canvas object
  handle all mouse movements is probably a good idea but of course updating the
  circle's position directly would have to change. It would probably make sense
  to move the click detection logic onto the canvas also, making use of the
  ~event.target~ property to determine which object would need updating.

- *Canvas Resizing*

  While the existing code makes some effort to ensure this works in a responsive
  manner it is currently only "statically responsive". What I mean is that on
  page load all the necessary calculations are performed to ensure that the
  ~viewBox~ has the correct proportions for example. However if the user were to
  resize the webpage, or rotate their device chances are the proportions of the
  canvas would change meaning that the circle would no longer follow the cursor
  correctly.

  In order to be truly responsive, we would need to listen for events such as
  [[https://developer.mozilla.org/en-US/docs/Web/API/Window/resize_event][resize]] and perform all the calculations again.

- *Pan and Zoom*

  Something I realised when writing up the part where we map the cursor's
  position onto the position of the circle is that I had by chance chosen a
  special case where the maths is a little easier. The calculations ~x *
  viewBox.width~ and ~y * viewBox.height~ only work because our ~viewBox~ starts
  at ~(0, 0)~.

  Say we had an application that also allowed for panning and zooming of the
  canvas itself then the chances are our ~viewBox~ would not be starting at ~(0,
  0)~ and we would have to include an offset in our calculations to reflect
  this. This means for the general case our code should probably look something
  like this

  #+BEGIN_SRC javascript
  circle.setAttribute("cx", (x * viewBox.width) - viewBox.minX)
  circle.setAttribute("cy", (y * viewBox.height) - viewBox.minY)
  #+END_SRC

I'm sure there are more edge cases and considerations to think of but this post
is long enough already! - Perhaps this is why people use libraries for this kind
of thing 🤔...

I will leave you with the final version of the code that went into the demo you
saw at the start of this blog post so you can see it all in context. Hopefully
you found this useful and I'll see you in the next one!

#+BEGIN_SRC javascript :noweb yes :tangle ../static/js/click-drag.js
// Setup
<<create-canvas>>

// Viewbox
<<set-viewbox>>

// Something to click on
<<add-circle>>

// Implementing the drag
<<dragging>>

// Click detection
<<clicking>>
#+END_SRC
#+BEGIN_SRC javascript :exports none :tangle ../static/js/click-drag-offset.js
  function offsetDemo() {

      const svgns = "http://www.w3.org/2000/svg"
      const canvas = document.getElementById("offset-demo-canvas")
      const target = document.getElementById("offset-target")
      const position = document.getElementById("offset-position")
      const posBox = document.getElementById("offset-posbox")
      posBox.setAttribute("viewBox", "0 0 1 1")

      let bbox = canvas.getBoundingClientRect()
      const aspectRatio = bbox.width / bbox.height

      const height = 100
      const width = aspectRatio * height

      const viewBox = {minX: 0, minY: 0, width: width, height: height}

      const viewBoxStr = [
          viewBox.minX, viewBox.minY, viewBox.width, viewBox.height
      ].join(" ")

      canvas.setAttribute("viewBox", viewBoxStr)

      const circle = document.createElementNS(svgns, "circle")
      circle.setAttribute("cx", viewBox.width / 2)
      circle.setAttribute("cy", viewBox.height / 2)
      circle.setAttribute("r", 25)
      circle.setAttribute("fill", "#57cc8a")

      canvas.appendChild(circle)

      const point = document.createElementNS(svgns, "circle")
      point.setAttribute("cx", 0)
      point.setAttribute("cy", 0)
      point.setAttribute("r", 0.05)
      point.setAttribute("fill", "#57cc8a")

      posBox.appendChild(point)

      canvas.addEventListener("mousemove", (event) => {

          const x = event.offsetX
          const y = event.offsetY

          bbox = canvas.getBoundingClientRect()

          const u = x / bbox.width
          const v = y / bbox.height

          position.innerText = "(" + x + "px, " + y + "px)"
          target.innerText = "<" + event.target.tagName + ">"

          point.setAttribute("cx", u)
          point.setAttribute("cy", v)
      })
  }

  offsetDemo()
#+END_SRC
#+BEGIN_SRC javascript :exports none :tangle ../static/js/click-drag-client.js
  function clientDemo() {
      const svgns = "http://www.w3.org/2000/svg"

      const canvas = document.getElementById("client-demo-canvas")
      const target = document.getElementById("client-target")
      const position = document.getElementById("client-position")
      const posBox = document.getElementById("client-posbox")
      posBox.setAttribute("viewBox", "0 0 1 1")

      let bbox = canvas.getBoundingClientRect()
      const aspectRatio = bbox.width / bbox.height

      const height = 100
      const width = aspectRatio * height

      const viewBox = {minX: 0, minY: 0, width: width, height: height}
      const viewBoxStr = [
          viewBox.minX, viewBox.minY, viewBox.width, viewBox.height
      ].join(" ")

      canvas.setAttribute("viewBox", viewBoxStr)

      const circle = document.createElementNS(svgns, "circle")
      circle.setAttribute("cx", viewBox.width / 2)
      circle.setAttribute("cy", viewBox.height / 2)
      circle.setAttribute("r", 25)
      circle.setAttribute("fill", "#57cc8a")

      canvas.appendChild(circle)

      const point = document.createElementNS(svgns, "circle")
      point.setAttribute("cx", 0)
      point.setAttribute("cy", 0)
      point.setAttribute("r", 0.05)
      point.setAttribute("fill", "#57cc8a")

      posBox.appendChild(point)

      canvas.addEventListener("mousemove", (event) => {

          bbox = canvas.getBoundingClientRect()

          const x = event.clientX - bbox.left
          const y = event.clientY - bbox.top

          position.innerText = `(${x.toFixed(0)}px, ${y.toFixed(0)}px)`
          target.innerText = `<${event.target.tagName}>`

          point.setAttribute("cx", x / bbox.width)
          point.setAttribute("cy", y / bbox.height)
      })

  }

  clientDemo()
#+END_SRC

